*&---------------------------------------------------------------------*
*& Include          ZRDAR_TEMPLATE01_FOM
*&---------------------------------------------------------------------*

*&---------------------------------------------------------------------*
*& Form INIT_PROG
*&---------------------------------------------------------------------*
*& 프로그램 전역변수 초기화
*&---------------------------------------------------------------------*
FORM init_prog .

  "**********************************************************************
  "* 선택조건
  "**********************************************************************
  DATA : ls_cond TYPE zrdacl_rep_dev_list=>ty_s_cond.

  ls_cond-s_prjid = s_prjid[].
  ls_cond-s_mod   = s_mod[].
  ls_cond-s_list  = s_list[].
  ls_cond-s_desid = s_desid[].
  ls_cond-s_desnm = s_desnm[].
  ls_cond-s_desui = s_desui[].
  ls_cond-s_desun = s_desun[].
  ls_cond-s_devui = s_devui[].
  ls_cond-s_devun = s_devun[].
  ls_cond-s_fdate = s_fdate[].
  ls_cond-s_tdate = s_tdate[].
  ls_cond-s_listy = s_listy[].
  ls_cond-s_keytext = s_status[].

  IF go_0100_rep IS NOT BOUND.
    CREATE OBJECT go_0100_rep
      EXPORTING
        is_cond = ls_cond.
  ENDIF.

ENDFORM.


*&---------------------------------------------------------------------*
*& Form GET_DATA
*&---------------------------------------------------------------------*
*& 데이터검색
*&---------------------------------------------------------------------*
FORM get_data .

  go_0100_rep->ma_get_data( ).

ENDFORM.


*&---------------------------------------------------------------------*
*& Form CALL_SCREEN
*&---------------------------------------------------------------------*
*& 화면호출
*&---------------------------------------------------------------------*
FORM call_screen .

  CALL SCREEN 0100.

ENDFORM.


*&---------------------------------------------------------------------*
*& Form FREE_DATA
*&---------------------------------------------------------------------*
*& 전역변수 초기화
*&---------------------------------------------------------------------*
FORM free_data .

  IF go_0100_rep IS BOUND.
    go_0100_rep->md_free_data( ).
  ENDIF.

ENDFORM.


*&---------------------------------------------------------------------*
*& Form INIT_SELSCR
*&---------------------------------------------------------------------*
*& Selection 스크린 변수 초기화
*&---------------------------------------------------------------------*
FORM init_selscr .

ENDFORM.


*&---------------------------------------------------------------------*
*& Form GET_STATUS_VAL_REQ
*&---------------------------------------------------------------------*
FORM get_status_val_req .

  DATA(lt_return) = zrdacl_dev_status=>get_h_status( 'S_STATUS-LOW' ).

  CHECK lt_return IS NOT INITIAL.

  s_status-low = lt_return[ 1 ]-fieldval.

ENDFORM.
